# import libraries

In [3]:
import pandas as pd
import numpy as np

# Create random data using the pd.DataFrame()

In [13]:
data = pd.DataFrame({"Name": ['neveen', 'yaser', 'tia','kamal'],
                     "age": ["31", "33", "29", "32"],
                     "1st-exam":[88,90,70,87],
                    "2nd-exam":[78,93,82,79]})

In [15]:
data

     Name age  1st-exam  2nd-exam
0  neveen  31        88        78
1   yaser  33        90        93
2     tia  29        70        82
3   kamal  32        87        79

# Create a new column and execute a mathematical procedure

In [19]:
# create final score column
data["final-score"] = data.apply(lambda row: (row["1st-exam"] + row["2nd-exam"]) / 2, axis=1)
data

     Name age  1st-exam  2nd-exam  final-score
0  neveen  31        88        78         83.0
1   yaser  33        90        93         91.5
2     tia  29        70        82         76.0
3   kamal  32        87        79         83.0

# Create flag column

In [22]:
data['final_grade'] = data['final-score'].apply(
lambda x:  'A' if x > 91 else ('B' if x >=81 else 'C'))

In [24]:
data

     Name age  1st-exam  2nd-exam  final-score final_grade
0  neveen  31        88        78         83.0           B
1   yaser  33        90        93         91.5           A
2     tia  29        70        82         76.0           C
3   kamal  32        87        79         83.0           B